app/controllers/medications_controller.rb

SELECT "medications".* FROM "medications"
---
    def index
        @medications = Medication.all

INSERT INTO "medications" ("name", "form", "strength", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Oxy"], ["form", "tablet"], ["strength", "10mg"], ["patient_id", 3], ["created_at", "2020-08-07 20:23:04.209584"], ["updated_at", "2020-08-07 20:23:04.209584"]]
---
    def create
        @medication = Medication.create(medication_params(:name, :form, :strength, :patient_id))