app/controllers/patients_controller.rb

    def index
        patients = Patient.all
---
SELECT "patients".* FROM "patients"

    def create
        patient = Patient.new(patient_params(:name, :age))
        if patient.save
---
INSERT INTO "patients" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Christian Cherr"], ["age", 28], ["created_at", "2020-08-07 20:22:37.278583"], ["updated_at", "2020-08-07 20:22:37.278583"]]